"""
Задача 1 (Легкая)
Напишите программу, которая выводит все четные числа от 1 до 20.
"""
for i in range(1, 21):
    if i % 2 == 0:
        print(i)
    

"""
Задача 2 (Легкая-Средняя)
Напишите программу, которая запрашивает у пользователя числа до тех пор, пока он не введет 0. Затем выведите сумму всех введенных чисел.
"""

total = 0.0
while True:
    user_response = input("Введите любое число или введите 0 для завершения работы: ")
    if user_response == '0':
        break
    try:
        user_response = float(user_response)
        total += user_response
    except ValueError:
        print(f"{user_response} не является числом, введите число снова.")
print(f"Сумма введенных чисел составила: {total}")

"""
Задача 3 (Средняя)
Напишите программу, которая генерирует последовательность Фибоначчи до N-го элемента. N вводит пользователь.
"""
while True:
    try:
        n = int(input("Введите до какого числа последовательности Фибонначи нужно сгенерировать: "))
        if n <= 0:
            print("Пожалуйста, введите положительное число!")
            continue
        break
    except ValueError:
        print(f"Пожалуйста введите целое число!")

fib_list = [0, 1]
a = 0
b = 1

if n == 1:
    print([a])
elif n == 2:
    print(fib_list)
else:
    for i in range(2, n):
        next_fib = a + b
        fib_list.append(next_fib)
        a, b = b, next_fib
    print(fib_list)



"""
Задача 4 (Сложная)
Напишите программу, которая проверяет, является ли введенная строка палиндромом (читается одинаково слева направо и справа налево),
игнорируя пробелы, знаки препинания и регистр букв.
"""
import re
user_string = re.sub(r'[^\w\s]' , '' , input("Введите строку для проверки на полиндром: ").lower().replace(" ", ""))  
isPalindrome = True

#посимвольное сравнение циклом
#for i in range(len(user_string) // 2):
#    if user_string[i] != user_string[-i-1]:
#        isPalindrome = False

if user_string != user_string[::-1]: #сравнение строки и строки наоборот
    isPalindrome = False

if isPalindrome:
    print("✅ Ваша строка полиндром")
else:
    print("❌ Ваша строка не является полиндромом")

"""
Задача 5 (Очень сложная)
Реализуйте программу для игры "Угадай число", где компьютер загадывает число от 1 до 100, а пользователь пытается угадать.
Программа должна подсказывать "больше" или "меньше" и вести статистику попыток. Добавьте уровни сложности с разным количеством попыток.
"""
""" 
Первый неоптимизированный вариант
import random
search_number = random.randint(1, 100)
difficulties = ["easy", "medium" , "hard"]
while True:
    user_dif = input(f"Введите сложность для игры из списка {difficulties}: ")
    if user_dif not in difficulties:
        print("Неподдерживаемая сложность пожалуйства введите еще раз")
        continue
    break

match user_dif:
    case "easy":
        attempts = 20 
    case "medium":
        attempts = 15
    case "hard":
        attempts = 10

user_attempts = 1
print(f"Вы играете в игру \"Угадай число\" ")
win_flag = False
while user_attempts < attempts:
    while True:
        try:
            user_guess = int(input("Введите ваш вариант: "))
            print(f"Текущая попытка:{user_attempts} Всего попыток на уровне сложности {user_dif}: {attempts}")
            if user_guess == search_number:
                win_flag = True
                print(f"Поздравляем !!! Вы угадали загаданное число: {search_number} за {user_attempts} попыток")
                break
            elif user_guess < search_number:
                print("Введенное число меньше загаданного")
                user_attempts += 1
                break
            elif user_guess > search_number:
                print("Введенное число больше загаданного")
                user_attempts += 1
                break
        except ValueError:
            print("Вы ввели не целое число")
            continue
    if win_flag:
        break
"""   
import random       
def play_game():
    """Основная функция игры"""
    search_number = random.randint(1, 100)
    difficulties = {
        "easy": 20,
        "medium": 15, 
        "hard": 10,
        "expert": 5
    }
    
    # Выбор уровня сложности
    print("🎮 Добро пожаловать в игру 'Угадай число'!")
    print("Доступные уровни сложности:")
    for diff, attempts in difficulties.items():
        print(f"  - {diff}: {attempts} попыток")
    
    while True:
        user_dif = input("\nВыберите уровень сложности: ").lower().strip()
        if user_dif in difficulties:
            attempts_limit = difficulties[user_dif]
            break
        else:
            print("❌ Неподдерживаемая сложность. Пожалуйста, выберите из доступных вариантов.")
    
    print(f"\n✅ Выбран уровень '{user_dif}' с {attempts_limit} попытками")
    print("Я загадал число от 1 до 100. Попробуйте угадать!")
    print("-" * 50)
    
    # Основной игровой цикл
    used_attempts = 0
    win = False
    
    while used_attempts < attempts_limit and not win:
        used_attempts += 1
        remaining_attempts = attempts_limit - used_attempts
        
        while True:
            try:
                user_guess = int(input(f"\n🎯 Попытка {used_attempts}/{attempts_limit}. Ваш вариант: "))
                if 1 <= user_guess <= 100:
                    break
                else:
                    print("❌ Число должно быть в диапазоне от 1 до 100!")
            except ValueError:
                print("❌ Пожалуйста, введите целое число!")
        
        # Проверка числа
        if user_guess == search_number:
            win = True
            print(f"\n🎉 ПОЗДРАВЛЯЕМ! Вы угадали число {search_number} за {used_attempts} попыток!")
        elif user_guess < search_number:
            print(f"📈 Загаданное число БОЛЬШЕ (осталось попыток: {remaining_attempts})")
        else:
            print(f"📉 Загаданное число МЕНЬШЕ (осталось попыток: {remaining_attempts})")
    
    # Результат игры
    if not win:
        print(f"\n💔 К сожалению, вы исчерпали все попытки. Загаданное число было: {search_number}")
    
    return win, used_attempts, attempts_limit

def main():
    """Главная функция с возможностью повторной игры"""
    games_played = 0
    games_won = 0
    total_attempts = 0
    
    while True:
        # Играем одну игру
        win, attempts, limit = play_game()
        
        # Обновляем статистику
        games_played += 1
        if win:
            games_won += 1
            total_attempts += attempts
        
        # Показываем статистику
        print("\n📊 Статистика:")
        print(f"   Сыграно игр: {games_played}")
        print(f"   Побед: {games_won}")
        if games_won > 0:
            print(f"   Среднее количество попыток для победы: {total_attempts / games_won:.1f}")
        
        # Предложение сыграть еще раз
        while True:
            play_again = input("\n🔄 Хотите сыграть еще раз? (да/нет): ").lower().strip()
            if play_again in ['да', 'д', 'yes', 'y']:
                print("\n" + "="*50)
                break
            elif play_again in ['нет', 'н', 'no', 'n']:
                print("\nСпасибо за игру! До свидания! 👋")
                return
            else:
                print("❌ Пожалуйста, введите 'да' или 'нет'")
play_game()